## 第五章 pandas入门

### 相关文档

(http://pandas-datareader.readthedocs.io/en/latest/)[http://pandas-datareader.readthedocs.io/en/latest/]

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Series类似于一维数组的对象

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
'b' in obj2

True

In [14]:
'c' in obj2

True

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
obj4 = pd.Series(sdata, index=states)

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj4.name = 'population'

In [29]:
obj4.index.name = 'state'

In [30]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DataFrame

In [31]:
data = {'state': ['Ohion', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [32]:
 frame = pd.DataFrame(data)

In [33]:
frame

   pop   state  year
0  1.5   Ohion  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [34]:
frame.head()

   pop   state  year
0  1.5   Ohion  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [35]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000   Ohion  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [36]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                    index=['one', 'two', 'three', 'four', 'five', 'six'])

In [37]:
frame2

       year   state  pop debt
one    2000   Ohion  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [38]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [39]:
frame['state']

0     Ohion
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [40]:
frame2.state

one       Ohion
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [42]:
frame2['debt'] = 16.5

In [43]:
frame2

       year   state  pop  debt
one    2000   Ohion  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [44]:
frame2['debt'] = np.arange(6.)

In [45]:
frame2

       year   state  pop  debt
one    2000   Ohion  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [46]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [47]:
frame2['debt'] = val

In [48]:
frame2

       year   state  pop  debt
one    2000   Ohion  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [49]:
frame2['eastern'] = frame2.state == 'Ohio'

In [50]:
frame2

       year   state  pop  debt  eastern
one    2000   Ohion  1.5   NaN    False
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [51]:
del frame2['eastern']

In [52]:
frame2

       year   state  pop  debt
one    2000   Ohion  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [54]:
frame3 = pd.DataFrame(pop)

In [55]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [56]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [57]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

AttributeError: 'list' object has no attribute 'astype'

In [ ]:
frame2.values

In [ ]:
frame3.values

In [ ]:
obj1 = pd.Series(range(3), index=['a', 'b', 'c'])

In [ ]:
index = obj1.index

In [ ]:
index

In [ ]:
index[1:]

In [ ]:
index[1] = 'd'

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj5 = pd.Series([1.5, -2.5, 0], index=labels)

In [ ]:
obj5

In [ ]:
obj5.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [ ]:
dup_labels

In [ ]:
frames = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [ ]:
frames

In [ ]:
frames.sort_values(by='b')

In [ ]:
frames.sort_values(by=['a', 'b'])

In [ ]:
obj6 = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj6.rank()

In [ ]:
obj6.rank(method='first')

### 带有重复标签的轴索引

In [ ]:
obj7 = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [ ]:
obj7

In [ ]:
obj7.index.is_unique

In [ ]:
obj7['a']

In [ ]:
obj7['c']

In [ ]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [ ]:
df

In [ ]:
df.loc['b']

In [ ]:
df.describe()

In [ ]:
df.describe(axis='columns')

In [ ]:
obj8 = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [ ]:
obj8

In [ ]:
obj8.describe()

### 相关系数和协方差

In [3]:
pd.core.common.is_list_like = pd.api.types.is_list_like
import pandas_datareader.data as web

In [6]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

ImmediateDeprecationError:
Yahoo Actions has been immediately deprecated due to large breaks in the API without the
introduction of a stable replacement. Pull Requests to re-enable these data
connectors are welcome.

See https://github.com/pydata/pandas-datareader/issues

In [8]:
import pandas_datareader as pdr

In [9]:
pdr.get_data_fred('GS10')

            GS10
DATE
2010-01-01  3.73
2010-02-01  3.69
2010-03-01  3.73
2010-04-01  3.85
2010-05-01  3.42
2010-06-01  3.20
2010-07-01  3.01
2010-08-01  2.70
2010-09-01  2.65
2010-10-01  2.54
2010-11-01  2.76
2010-12-01  3.29
2011-01-01  3.39
2011-02-01  3.58
2011-03-01  3.41
2011-04-01  3.46
2011-05-01  3.17
2011-06-01  3.00
2011-07-01  3.00
2011-08-01  2.30
2011-09-01  1.98
2011-10-01  2.15
2011-11-01  2.01
2011-12-01  1.98
2012-01-01  1.97
2012-02-01  1.97
2012-03-01  2.17
2012-04-01  2.05
2012-05-01  1.80
2012-06-01  1.62
...          ...
2015-12-01  2.24
2016-01-01  2.09
2016-02-01  1.78
2016-03-01  1.89
2016-04-01  1.81
2016-05-01  1.81
2016-06-01  1.64
2016-07-01  1.50
2016-08-01  1.56
2016-09-01  1.63
2016-10-01  1.76
2016-11-01  2.14
2016-12-01  2.49
2017-01-01  2.43
2017-02-01  2.42
2017-03-01  2.48
2017-04-01  2.30
2017-05-01  2.30
2017-06-01  2.19
2017-07-01  2.32
2017-08-01  2.21
2017-09-01  2.20
2017-10-01  2.36
2017-11-01  2.35
2017-12-01  2.40
2018-01-01  2.58
2018-02-01  2.86
2018-03-01  2.84
2018-04-01  2.87
2018-05-01  2.98

[101 rows x 1 columns]

### 唯一值，值计数以及成员资格

In [10]:
obj9 = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'd'])

In [12]:
uniques = obj9.unique()

In [13]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [14]:
obj9.value_counts()

a    3
c    2
b    2
d    2
dtype: int64

In [15]:
pd.value_counts(obj9.values, sort=False)

d    2
b    2
a    3
c    2
dtype: int64

In [17]:
mask = obj9.isin(['b', 'c'])

In [18]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8    False
dtype: bool

In [19]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [20]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [21]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [22]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [25]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

In [26]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [28]:
result = data.apply(pd.value_counts).fillna(0)

In [29]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0